# Pandas is a python module that makes data science easy and effective.

#### Shift + Tab in jupter notebook to see function documentation
### csv module takes time, might have bugs, big code etc
### with pandas we can do this easily, with few lines of code.

In [1]:
import pandas as pd
df = pd.read_csv('nyc_weather.csv')
df.head(5)

,EST,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees
0,1/1/2016,38,23,52,30.03,10,8.0,0,5,NaN,281
1,1/2/2016,36,18,46,30.02,10,7.0,0,3,NaN,275
2,1/3/2016,40,21,47,29.86,10,8.0,0,1,NaN,277
3,1/4/2016,25,9,44,30.05,10,9.0,0,3,NaN,345
4,1/5/2016,20,-3,41,30.57,10,5.0,0,0,NaN,333

In [9]:
print(df['Temperature'].max())  #gives max temp
print(df['EST'][df['Events']=='Rain'])  #gives days on which it rains
print(df['WindSpeedMPH'].mean())

50
8      1/9/2016
9     1/10/2016
15    1/16/2016
26    1/27/2016
Name: EST, dtype: object
6.89285714286

Process of Cleaning messy data is called data munging or data wrangling.
In csv file data is messy.
To replace NA fields

In [10]:
df.fillna(0,inplace=True)
print(df['WindSpeedMPH'].mean())

6.22580645161

In df NaN is replaced by 0 because of 'inplace=True'; even NaN in Events also

In [2]:
df.head(2)

,EST,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees
0,1/1/2016,38,23,52,30.03,10,8.0,0,5,NaN,281
1,1/2/2016,36,18,46,30.02,10,7.0,0,3,NaN,275

# Dataframes

### Dataframe is main object in Pandas. It is used to represent rows and columns (sheet like data).

In [3]:
df = pd.read_csv('nyc_weather.csv') #create a dataframe from a CSV file
df.head(2)

,EST,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees
0,1/1/2016,38,23,52,30.03,10,8.0,0,5,NaN,281
1,1/2/2016,36,18,46,30.02,10,7.0,0,3,NaN,275

In [39]:
weather_data = {
    'name':['Aditya','Tanmay','Deepankar','Suyog','Mami'],
    'sname':['Jain','Dube','Ojha','Boro','Mami']
}
my_df = pd.DataFrame(weather_data) #create Dataframe from dictionary
my_df

        name sname
0     Aditya  Jain
1     Tanmay  Dube
2  Deepankar  Ojha
3      Suyog  Boro
4       Mami  Mami

In [17]:
rows , columns = my_df.shape #return a tuple containing (row,columns)
print((rows,columns))

(5, 2)

If your datadrame has 1000s of rows it print them all if we print df.
So to print few rows and header use following

In [18]:
df.head() #print first 5 rows

,EST,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees
0,1/1/2016,38,23,52,30.03,10,8.0,0,5,NaN,281
1,1/2/2016,36,18,46,30.02,10,7.0,0,3,NaN,275
2,1/3/2016,40,21,47,29.86,10,8.0,0,1,NaN,277
3,1/4/2016,25,9,44,30.05,10,9.0,0,3,NaN,345
4,1/5/2016,20,-3,41,30.57,10,5.0,0,0,NaN,333

In [ ]:
df.tail(3) #print last 3 rows
df[2:5]  #print rows 2 to 4

In [4]:
df.columns # print all columns
df['Events'].head(3) #print Events Columns

0    NaN
1    NaN
2    NaN
Name: Events, dtype: object

In [5]:
df[['Events','Temperature']].head(2) #print few columns only

  Events  Temperature
0    NaN           38
1    NaN           36

In [ ]:
df['Temperature'].mean()
df['Temperature'].min()
df['Temperature'].stf()
df['Temperature'].min()

# Printing Statistics of Data using describe function.

In [21]:
df['Temperature'].describe() #describe particular column

count    31.000000
mean     34.677419
std       7.639315
min      20.000000
25%      29.000000
50%      35.000000
75%      39.500000
max      50.000000
Name: Temperature, dtype: float64

In [22]:
df.describe() #decribe whole table

,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,CloudCover,WindDirDegrees
count,31.000000,31.000000,31.000000,31.000000,31.000000,28.000000,31.000000,31.000000
mean,34.677419,17.838710,51.677419,29.992903,9.193548,6.892857,3.129032,247.129032
std,7.639315,11.378626,11.634395,0.237237,1.939405,2.871821,2.629853,92.308086
min,20.000000,-3.000000,33.000000,29.520000,1.000000,2.000000,0.000000,34.000000
25%,29.000000,10.000000,44.500000,29.855000,9.000000,5.000000,1.000000,238.000000
50%,35.000000,18.000000,50.000000,30.010000,10.000000,6.500000,3.000000,281.000000
75%,39.500000,23.000000,55.000000,30.140000,10.000000,8.000000,4.500000,300.000000
max,50.000000,46.000000,78.000000,30.570000,10.000000,16.000000,8.000000,345.000000

## We can also use Dataframe as a Sql table and use conditions like WHERE in SQL

In [ ]:
print( df['Temperature'][df['Temperature']>40] ) #print temperatures which are greater than 40
print( df[['Temperature','EST']][df['Temperature']>40] ) #print EST,temperatures which are greater than 40
print( df[df['Temperature']==df['Temperature'].max()] ) #print row with max temperature

In [40]:
print(my_df.index)
my_df.set_index('name',inplace=True) #inplace modify df otherwise it will return new df
print(my_df.index)

RangeIndex(start=0, stop=5, step=1)
Index(['Aditya', 'Tanmay', 'Deepankar', 'Suyog', 'Mami'], dtype='object', name='name')

The advantage of doing this is 
1. We can run loc

In [45]:
print(my_df.loc['Aditya'])
df.reset_index(inplace=True) #reset index
print(df.index)

sname    Jain
Name: Aditya, dtype: object
RangeIndex(start=0, stop=31, step=1)

Different ways of creating Dataframe
1. From CSV
2. Using Excel
3. py Dict
4. list of tuples
5. list of dictionaries
there are other ways too like json,pickle etc see in documentation

In [ ]:
# df = pd.read_csv("weather_data.csv")  #from CSV
# df = pd.read_excel("weather_data.xlsx","Sheet1") #from excel sheet
#df = pd.DataFrame(dict)
weather_data = [
    ('1/1/2017',32,6,'Rain'),
    ('1/2/2017',24,7,'Sunny'),
    ('1/3/2017',28,2,'Snow')
]
df1 = pd.DataFrame(weather_data,columns=["day","temperature","windspeed","event"]) #from list of tubles
print(df1)
weather_data = [
    {"day":"1/1/2017","temp":32,'windspeed':6,'event':'Rain'},
    {"day":"1/2/2017","temp":34,'windspeed':2,'event':'Snow'}
]
df2 = pd.DataFrame(weather_data)
print(df2)

## Adding New Column

In [ ]:
df1['newColumn'] = col   #Column is new column
df1['newColumn'] = 0     #initialize column with all value 0

## Concat two table one after other
### Append rows

In [30]:
india_weather = pd.DataFrame({
    'city':['Mumbai','Delhi'],
    'Temperature':[30,18]
})
us_weather = pd.DataFrame({
    'city':['New York','Chicago'],
    'Temperature':[16,10]
})
weather  = pd.concat([india_weather,us_weather],ignore_index=True)
weather #look at indexing it is not proper, to avoid that use ignore_index=True
#concat = train_df.append(test_df, ignore_index=True) #concat is new table

   Temperature      city
0           30    Mumbai
1           18     Delhi
2           16  New York
3           10   Chicago

In [35]:
weather = pd.concat([india_weather,us_weather],keys=['india','us'])
print(weather)
weather.loc['india']

         Temperature      city
india 0           30    Mumbai
      1           18     Delhi
us    0           16  New York
      1           10   Chicago

   Temperature    city
0           30  Mumbai
1           18   Delhi

### append Columns

In [39]:
temp = pd.DataFrame({
    'city':['Mumbai','Delhi'],
    'Temperature':[30,18]}).set_index('city')
windspeed = pd.DataFrame({
    'city':['Delhi','Mumbai'],
    'windspeed':[108,69]}).set_index('city')
temp_wind = pd.concat([temp,windspeed],axis=1) #concatination done by index
print(temp_wind)
temp_wind.reset_index(inplace=True)
temp_wind

        Temperature  windspeed
Delhi            18        108
Mumbai           30         69

    index  Temperature  windspeed
0   Delhi           18        108
1  Mumbai           30         69

## Merge 
#### we have to specify index in concat by columns, other better option is merge

In [48]:
temp = pd.DataFrame({
    'city':['Mumbai','Delhi'],
    'Temperature':[30,18]})
windspeed = pd.DataFrame({
    'city':['Delhi','Mumbai','Pune'],
    'windspeed':[108,69,73]})
temp_wind = pd.merge(temp,windspeed,on="city",how="outer")   # by default it is inner join, other='outer','left','right'
temp_wind

   Temperature    city  windspeed
0         30.0  Mumbai         69
1         18.0   Delhi        108
2          NaN    Pune         73

## Print all unique values for a column

In [6]:
print(df.Events.unique())
df.Events.fillna('0',inplace=True)
df.Events.unique()

[nan 'Rain' 'Fog-Snow' 'Snow']

array(['0', 'Rain', 'Fog-Snow', 'Snow'], dtype=object)

## View datatypes of all columns

In [7]:
df.dtypes

EST                      object
Temperature               int64
DewPoint                  int64
Humidity                  int64
Sea Level PressureIn    float64
VisibilityMiles           int64
WindSpeedMPH            float64
PrecipitationIn          object
CloudCover                int64
Events                   object
WindDirDegrees            int64
dtype: object

## Split training and Testing Data

In [ ]:
# split train and test sets
train_le = df.iloc[:891].copy()
test_le = df.iloc[891:].copy()

## GroupBy

In [24]:
print(df.Events.unique())
g = df.groupby('Events') #forms DataFrameGroupBy object
for event,event_df in g:
    print("-----"+event+"-----")
    print(event_df[['EST','Temperature','Humidity']].head(1))
g.get_group('Snow')

['0' 'Rain' 'Fog-Snow' 'Snow']
-----0-----
        EST  Temperature  Humidity
0  1/1/2016           38        52
-----Fog-Snow-----
          EST  Temperature  Humidity
16  1/17/2016           36        66
-----Rain-----
        EST  Temperature  Humidity
8  1/9/2016           44        77
-----Snow-----
          EST  Temperature  Humidity
17  1/18/2016           25        53

,EST,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees
17,1/18/2016,25,6,53,29.83,9,12.0,T,2,Snow,293
21,1/22/2016,26,6,41,30.21,9,NaN,0.01,3,Snow,34
23,1/24/2016,28,11,53,29.92,8,6.0,T,3,Snow,327

In [25]:
# g.statistics()
# g.mean()
g.max() #maximum for all groups for all columns

,EST,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,PrecipitationIn,CloudCover,WindDirDegrees
Events,,,,,,,,,,
0,1/8/2016,46,31,64,30.57,10,11.0,T,8,345
Fog-Snow,1/23/2016,36,23,78,29.78,8,16.0,2.31,8,345
Rain,1/9/2016,50,46,77,30.16,10,8.0,T,8,340
Snow,1/24/2016,28,11,53,30.21,9,12.0,T,3,327

# Reading CSV File-

In [ ]:
df= pd.read_csv("weather",skiprows=2) #skip 2 rows
df = pd.read_csv("weather",header=2) #header located at row 2
df = pd.read_csv("weather",header=None,names=["temperature",humidity]) #if headers are not given
df = pd.read_csv("weather",nrows=3) #read only 3 rows except header
df = pd.read_csv("weather",na_values=["not avaialble","n.a","na"]) #turn na_values to NaN
df = pd.read_csv("weather",na_values={
        'eps':["not available","n.a."],
        'revenue':["not available","n.a.",-1],
        'people':["na"]
    }) #if different columns have different NA values

#other useful properties also look in documentation

# Writing CSV file-

In [ ]:
df.to_csv('new.csv') #write to csv with index
df.to_csv('new.csv',index=False) #write to csv without index
df.to_csv('new.csv',columns=['temperarture','humidity']) #write only 2 columns
df.to_csv('new.csv',header=False) #write without header

# Handle Missing Data (with replace func)-

In [ ]:
import numpy as np
new_df = df.replace(-9999,np.NaN) #replace -9999 with NaN
new_df = df.replace([-9999,-8888],np.NaN) #replace -9999 and -8888 with NaN
new_df = df.replace({
        'temperature': -9999,
        'windspeed' : [-9999,-8888],
        'event':'0'
    },np.NaN) #differnt column have diff na value
new_df = df.replace({
    -9999 : np.NaN,
    "No Event":'Sunny'
    }) #replace different value differently (mapping)
new_df = df.replace({
    'temperature':'[A-Za-z]',
    'windspeed':'[A-Za-z]'
},'',regex=True) #convert 7 mph to 7 or 30 c to 30
new_df = df.replace(['poor','average','good'],[1,2,3]) #pretty good for data processing

# Handle Missing Data (fillna,dropna,interpolate)

In [ ]:
df = pd.read_csv('weather_data.csv',parse_dates=['day']) #convert date(str) to timestamp
newdf = df.fillna({
        'temperature':0,
        'windspeed':0,
        'event':'No Event'
    }) #fill NA values with different values

#but temperature is not 0. So lets estimate value
new_df = df.fillna(method='ffill') #forward fill
new_df = df.fillna(method='bfill',limit=1) #backward fill and limit to 1 row only
# see documentation

#but in NA, value should be in between both value
new_df = df.interpolate() #gives better guess
#lets interpolate it according to time
new_df = df.interpolate(method='time') #powerful feature

new_df = df.dropna() #dont consider NaN rows
new_df = df.dropna(how='all') #drop if all values are NaN
new_df = df.dropna(thresh=1) #keep row if it has atleast 1 valid value

# Rearrange Table - pivot
Use Pivot - https://www.youtube.com/watch?v=xPPs59pn6qU&index=10&t=65s&list=PLeo1K3hjS3uuASpe-1LjfG5f14Bnozjwy
# Perform Aggregation and pivot
Use pivot_table - https://www.youtube.com/watch?v=xPPs59pn6qU&index=10&t=65s&list=PLeo1K3hjS3uuASpe-1LjfG5f14Bnozjwy
# Transform and reshape data
Use melt - https://www.youtube.com/watch?v=oY62o-tBHF4&index=11&list=PLeo1K3hjS3uuASpe-1LjfG5f14Bnozjwy

# Also for Reshaping Table - stack/unstack
Use stack/unstack - https://www.youtube.com/watch?v=BUOy4RUUepg&index=12&list=PLeo1K3hjS3uuASpe-1LjfG5f14Bnozjwy

# Contingency Table or Crosstab or Crosstabulation
In statistics, a contingency table (cross tabulation or cross tab) is a type of table in matrix form that displays the (multivariate) frequency distribution of the variables.

In [5]:
df2 = pd.read_excel('survey.xls')
df2.head(5)

     Name Nationality     Sex  Age Handedness
0   Kathy         USA  Female   23      Right
1   Linda         USA  Female   18      Right
2   Peter         USA    Male   19      Right
3    John         USA    Male   22       Left
4  Fatima   Bangadesh  Female   31       Left

In [11]:
pd.crosstab(df2.Nationality,df2.Handedness,margins=True)

Handedness   Left  Right  All
Nationality
Bangadesh       2      0    2
China           2      1    3
India           2      1    3
USA             1      3    4
All             7      5   12

In [15]:
pd.crosstab(df2.Sex,[df2.Handedness,df2.Nationality])
pd.crosstab([df2.Sex,df2.Nationality],df2.Handedness)

Handedness          Left  Right
Sex    Nationality
Female Bangadesh       1      0
       China           1      1
       USA             0      2
Male   Bangadesh       1      0
       China           1      0
       India           2      1
       USA             1      1

In [17]:
import numpy as np
pd.crosstab(df2.Sex,df2.Handedness,values=df2.Age,aggfunc=np.mean)

Handedness  Left  Right
Sex
Female      44.5   31.0
Male        31.2   28.0